# IFCFamilyInstanceExtrusionExportResults Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFamilyInstanceExtrusionExportResults Class
Members See Also
---
This class represents the results of a geometric analysis of a family instance.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class IFCFamilyInstanceExtrusionExportResults : IDisposable
```

Visual Basic
---
```text
Public Class IFCFamilyInstanceExtrusionExportResults _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IFCFamilyInstanceExtrusionExportResults : IDisposable
```

# Remarks
The analysis attempts to convert the geometry of the instance into a single extrusion with additional extruded openings cutting the main solid.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCFamilyInstanceExtrusionExportResults
# See Also
IFCFamilyInstanceExtrusionExportResults Members
Autodesk.Revit.DB.IFC Namespace